# -*- coding: utf-8 -*-
"""
Created on Tue Feb 20 17:06:50 2018


"""

'''from collections import Counter
from pythainlp.tokenize import word_tokenize
from pythainlp.corpus import stopwords


#text = "เมื่อวันที่ 15 ก.พ. น.ส.เจนิซ ลี กรรมการผู้จัดการ PCCW Media Group กล่าวว่า Viu วิว ผู้นำบริการคอนเทนต์ OTT ระดับภูมิภาค ในเครือ PCCW Media Group เซ็นสัญญากับ JTBC ช่องทีวีเคเบิลชั้นนำของเกาหลี นำคอนเทนต์บันเทิงกว่า 80% ของ JTBC \"ทั้งซีรีส์คุณภาพและรายการวาไรตี้ต่าง ๆ มาเสิร์ฟบนหน้าจอ Viu ให้ผู้ชมชาวไทยได้ติดตาม ข้อตกลงครั้งนี้นับว่าเป็นการทำสัญญาคอนเทนต์ครั้งใหญ่ที่สุดในเอเชียสำหรับ JTBC ซึ่งส่งผลให้ Viu กลายเป็นผู้ให้บริการคอนเทนต์ซีรีส์ละครเกาหลีและรายการวาไรตี้ที่ใหญ่ที่สุดในเอเชียตะวันออกเฉียงใต้ ที่อัดแน่นด้วยคอนเทนต์เด่นจาก 4 ช่องโทรทัศน์หลักของเกาหลีอย่าง KBS, MBC และ SBS รวมถึงภาพยนตร์จากค่าย tvN Movies อีกด้วยภายใต้ข้อตกลงนี้ ผู้ใช้บริการ Viu จะได้เพลิดเพลินไปกับซีรีส์ละครและรายการวาไรตี้จาก JTBC หลายร้อยชั่วโมง พร้อมซับไตเติ้ลภาษาไทยถูกลิขสิทธิ์ภายในวันถัดไปหลังออกอากาศที่เกาหลี ตอบสนองความต้องการของแฟนคอนเทนต์เกาหลีใต้ในฮ่องกง สิงคโปร์ มาเลเซีย ไทย อินโดนีเซีย และฟิลิปปินส์ได้อย่างจุใจ ด้วยเนื้อหาที่สดใหม่และมีเอกลักษณ์เฉพาะตัว ทำให้ช่อง JTBC เป็นหนึ่งใน 4 สถานีโทรทัศน์ชั้นแนวหน้าของเกาหลีในด้านซีรีส์และรายการวาไรตี้ เมื่อไม่นานมานี้ ยังมีซีรีส์ฮิตสองเรื่องที่ทำเรตติ้งสูงอย่างต่อเนื่อง ได้แก่ Strong Girl Bongsoon และ The Ly in Dignity ซึ่งเป็นซีรีส์ยอดฮิตที่ฉายทางเคเบิลทีวีเกาหลีในปี 2017Viu ยินดีเป็นอย่างยิ่งในการนำเสนอรายการต่าง ๆ ที่น่าสนใจของ JTBC มาให้แก่ผู้ชมและแฟน ๆ ทั่วทั้งเอเชีย เป็นการตอกย้ำความมุ่งมั่นของ Viu ในการนำพรีเมียมคอนเทนต์ในเอเชียมาเสิร์ฟให้แก่ผู้ชม สมกับฐานะการเป็นแพลตฟอร์มวิดีโอ OTT ชั้นแนวหน้าในเอเชีย ซึ่ง Viu ได้ขยายพอร์ตของคอนเทนต์ไปในทั้งในเชิงกว้างและเชิงลึก ครอบคลุมถึง Viu Original ซีรีส์จากอินเดีย จีน และอินโดนีเซีย ที่ร่วมงานกับผู้กำกับมือรางวัล ศิลปินที่มีชื่อเสียง และผู้ผลิตสื่อบันเทิงระดับพรีเมียมจากทั่วทั้งเอเชียนายจอง คยองมูน ประธานเจ้าหน้าที่บริหารของ JTBC Content Hub กล่าวว่า ซีรีส์ละครและรายการวาไรตี้ของ JTBC ได้รับความนิยมอย่างมาก จากเรตติ้งที่สูงสะท้อนให้เห็นถึงความมีคุณภาพและคุณค่าความบันเทิงที่มอบให้แก่ผู้ชม ด้วยมาตรฐานการผลิตคอนเทนต์ระดับพรีเมียมของเรา จึงยินดีที่ได้ร่วมมือกับ Viu ซึ่งเป็นหนึ่งในผู้ให้บริการวิดีโอ OTT ชั้นแนวหน้าของเอเชียในการนำเสนอคอนเทนต์รายการต่าง ๆ ให้เข้าถึงผู้ชมวงกว้างมากขึ้นทั่วทั้งภูมิภาคผ่านฐานแฟนอันเหนียวแน่นของ Viuนอกจากนี้ Viu ยังเตรียมนำเสนอซีรีส์ล่าสุดให้แก่ผู้ชม เช่น Misty และ Welcome to Waikiki โดยเรื่อง Misty เป็นแนวทริลเลอร์โรมานซ์ นำแสดงโดย คิมนัมจู และ จีจินฮี เนื้อเรื่องเกี่ยวกับอัยการผู้ผันตัวมาเป็นทนายแก้ต่างให้กับภรรยา ซึ่งเป็นผู้ประกาศข่าวชื่อดังที่ตกเป็นผู้ต้องสงสัยในเหตุการณ์ฆาตกรรม ขณะที่ชีวิตคู่กำลังสั่นคลอน เขาได้ตัดสินใจเป็นทนายให้กับภรรยา ในช่วงที่สืบสวนนั้นเอง ทั้งคู่ก็ได้รื้อฟื้นความรักที่มีต่อกัน ส่วนเรื่อง Welcome to Waikiki นำแสดงโดย คิมจองฮยอน อียีคยอง และ ซอนซึงวอน เนื้อหาเกี่ยวกับชายหนุ่ม 3 คนที่ตามหาความฝัน และได้มาบริหารเกสต์เฮ้าส์ชื่อ ไวกีกิ ด้วยกัน พร้อมด้วยซีรีส์เด่นจากทางสถานี เช่น Strong Girl Bongsoon, The Ly in Dignity, Secret Healer และเรื่องอื่น ๆ อีกมากมายสำหรับสถานี JTBC ยังมีรายการวาไรตี้หลายรายการที่ได้รับความนิยม ด้วยแขกรับเชิญระดับซูเปอร์สตาร์และไอดอลชื่อดัง เช่น รายการ Chef & My Fridge, Men on a Mission หรือที่รู้จักกันในชื่อ Knowing Brothers ในประเทศไทย และ Midnight Mness เป็นต้น โดยรายการ Chef & My Fridge ที่โดดเด่นด้วยแขกรับเชิญเชฟดังระดับโลก อาทิ กอร์ดอน แรมซีย์ และศิลปินดังมากมายที่มาร่วมแบ่งปันรายการอาหารส่วนตัว และเผยความลับในตู้เย็น รายการนี้เป็นรายการหนึ่งของ JTBC ที่ประสบความสำเร็จอย่างสูง. { 5 }"
text = "สภาศิลปินส่งเสริมพระพุทธศาสนาแห่งประเทศไทย สำนักงานพระพุทธศาสนาแห่งชาติ กรมการศาสนา กระทรวงวัฒนธรรม จัดงาน “มาฆะมหามงคล” โดยมีพระพรหมเสนาบดี รองสมเด็จพระราชาคณะเป็นประธานในพิธี มอบประกาศเกียรติคุณ “ทูตพระพุทธศาสนา ประจำวันมาฆบูชา 2561” โดยพิจารณาศิลปินดารานักร้องและพุทธศาสนิกชนเข้ารับประกาศเกียรติคุณ อาทิ เฌอปราง อารีย์กุล หรือ เฌอปราง BNK48 ไอดอลกรุ๊ปชื่อดังที่กำลังมาแรง นิววงศกร ปรมัตถาวร, มะเหมี่ยวพรชดา เครือคช เติมเติมเศวตรชัย นาคสุข นักแสดงจากช่อง 7 ยีนส์เกวลิน ศรีวรรณา, กฤตฎ์ อมรชัยฤกษ์ นักแสดงจากช่อง 8 ทอยปฐมพงศ์ เรือนใจดี, กิตณัฐกิตติ์ นันทพานิช นักแสดงช่อง จีเอ็มเอ็ม 25 และ น้องคิมซุนอณาคินทร์ ศรีภัทรวิทย์ นักแสดงเด็ก เข้ารับรางวัลทูตพระพุทธศาสนาเพื่อประกาศเกียรติคุณ ในฐานะพุทธศาสนิกชนชาวไทย ที่เผยแพร่คำสอนพระพุทธศาสนาอย่างต่อเนื่องเป็นแบบอย่างที่ดีของสังคมด้าน เฌอปรางเปิดเผยว่า รู้สึกดีใจมากที่ได้รับเลือกเป็นทูตพระพุทธศาสนาเพราะตั้งแต่สมัยอยู่มัธยมจะได้สวดมนต์และปฏิบัติธรรมที่โรงเรียนเป็นประจำอยู่แล้วแต่ในปัจจุบันอาจทำได้น้อยลงเพราะติดงาน แต่ถ้ามีโอกาสจะเข้าวัดทำบุญกับคุณพ่อคุณแม่ตลอด ในฐานะที่ตอนนี้เป็นศิลปิน เป็นบุคคลที่มีชื่อเสียงก็ขอทำหน้าที่พูดถึงพุทธศาสนาให้ทุกคนได้รับรู้มากขึ้นและอยากเชิญชวนให้ทุกคนทำบุญ ปฏิบัติดี ปฏิบัติชอบ ทำความดี ละเว้นความชั่ว ทำจิตใจให้ผ่องใส และอยากให้ทุกคนมีสติในการที่จะทำอะไร รวมถึงต้องเตือนตัวเองด้วยว่าเวลาทำอะไรต้องมีสติส่วนในวันมาฆบูชาวันที่ 1 มี.ค. นี้คงไปทำบุญและเวียนเทียนกับที่บ้าน"
sent = text.replace(" ","").replace("{","").replace("}","").replace("[","").replace("]","").replace("\"","")
word = word_tokenize(sent, engine='deepcut')
words =[]
        
for w in word:
    if w not in stopwords.words('thai'):
        words.append(w)

print(words)
cnt = Counter(words)
def numlist(num):
    return cnt.most_common(int(num))
print(numlist(20))'''
 
#select @n:=@n+1 as 'No.',url,title,body from article,(select @n:=-1) as m where genre in ('\'entertainment\'');
#SELECT @n:=@n+1 as 'No.',body FROM article, (SELECT @n:=-1) as m where genre in ('\'entertainment\'') INTO OUTFILE '/Users/RIKO/AnacondaProject/Dailynews/entertainment.csv' FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n';
#CREATE TABLE article_entertainment(url VARCHAR(200) NOT NULL, title VARCHAR(200) NOT NULL, genre VARCHAR(50) NOT NULL, body VARCHAR(10000) NOT NULL, time VARCHAR(50) NOT NULL, PRIMARY KEY(url));

from pythainlp import word_tokenize # ทำการเรียกตัวตัดคำ
from pythainlp.word_vector import thai2vec # ทำการเรียก thai2vec
from sklearn.metrics.pairwise import cosine_similarity  # ใช้หาค่าความคล้ายคลึง
import numpy as np
model=thai2vec.get_model() # ดึง model ของ thai2vec มาเก็บไว้ในตัวแปร model
def sentence_vectorizer(ss,dim=300,use_mean=True): # ประกาศฟังก์ชัน sentence_vectorizer
    ss = "วอนนาวันกับวอนนาเบิลจะอยู่ด้วยกันตลอดไป"
    s = word_tokenize(ss)
    vec = np.zeros((1,dim))
    for word in s:
        if word in model.wv.index2word:
            vec+= model.wv.word_vec(word)
        else: pass
    if use_mean: vec /= len(s)
    return vec
def sentence_similarity(s1,s2):
    return cosine_similarity(sentence_vectorizer(str(s1)),sentence_vectorizer(str(s2)))

